In [4]:
#1.Create a Panda Series from the python list [10,20,30,40,50] with the custom indexes['a','b','c','d','e']
# a. Print the first 3 elements
# b. Access the element at index 'c'
import pandas as pd
arr = [10,20,30,40,50]
panda_arr = pd.Series(arr,index=['a','b','c','d','e'])
print(panda_arr[0:3])
print(panda_arr['c'])

a    10
b    20
c    30
dtype: int64
30

In [35]:
#2. Create dataframe with duplicate rows
# a. Identify the duplicates and display only the duplicate row
# b. Drop the duplicates while
#   . Keeping the last occurence
#   . Removing all duplicates
import pandas as pd
data = {
    'Name':['Rajendra','Guru','Om','Sourav','Rajendra','Om'],
    'Age':[10,20,30,40,10,30],
    'City':['Angul','Cuttack','Jamshedpur','Baleswor','Angul','Jamshedpur']
}
df = pd.DataFrame(data)
# print(df.duplicated())
# df[df.duplicated()]

In [37]:
dff = df.drop_duplicates(keep=False)
dff

     Name  Age      City
1    Guru   20   Cuttack
3  Sourav   40  Baleswor

In [32]:
# 3. Create a DataFrame 
# data = {
#     'Department':['HR','IT','HR','IT','Finance'],
#     'Employee':['A','B','C','D','E'],
#     'Salary':[40000,50000,42000,55000,60000]
# }
# a. Find average salary per dept 
# b. Count employees in each dept
# c. Sort employees by salary in ascending order
# d. Sort by dept then by salary(descending)

import pandas as pd
data = {
    'Department':['HR','IT','HR','IT','Finance'],
    'Employee':['A','B','C','D','E'],
    'Salary':[40000,50000,42000,55000,60000]
}
df = pd.DataFrame(data)

print(df.sort_values(by='Salary',ascending=True),'\n')
dff = df
dff.sort_values(by='Department',ascending=False)
dff.sort_values(by='Salary',ascending = False)

  Department Employee  Salary
0         HR        A   40000
2         HR        C   42000
1         IT        B   50000
3         IT        D   55000
4    Finance        E   60000

  Department Employee  Salary
4    Finance        E   60000
3         IT        D   55000
1         IT        B   50000
2         HR        C   42000
0         HR        A   40000